 <img src="https://eant.tech/imagenes/logo.png" width=25% height=80%  >

## Global Health Observatory data repository

El siguiente conjunto de datos que vamos a trabjar contiene datos sobre las muertes causadas por Tuberculosis, estos datos son recopilados por el observatorio de la Organizacion mundial de la salud.
Los datos se pueden descargar del siguiente [link](
https://apps.who.int/gho/data/node.main.1317?lang=en)

<center>
<img src="https://i.ibb.co/qDWjWCj/logo-who.jpg" alt="logo-who" border="0">
</center>

üè∑Ô∏è 1. Importar pandas

In [1]:
import pandas as pd

üè∑Ô∏è 2. Importar el dataframe que se encuentra en la siguiente URL.

In [2]:
url='https://docs.google.com/spreadsheets/d/e/2PACX-1vR84JOFFZnonTTDgbtc686VZM4w7k-TvJ88OZL82srRyRgS_Aa1N127YYRyI0IalIzWtM3MYnUg2Yxg/pub?output=csv'

In [3]:
df = pd.read_csv(url)

üè∑Ô∏è 3. Visualizar las primeras filas del datafame

In [4]:
df.head()

,Country,Year,"Number of deaths due to tuberculosis, excluding HIV",Deaths due to tuberculosis among HIV-negative people (per 100 000 population)
0,Afghanistan,2018,11000 [6400-16000],29 [17-44]
1,Afghanistan,2017,11000 [6400-16000],30 [18-45]
2,Afghanistan,2016,12000 [7100-18000],34 [20-51]
3,Afghanistan,2015,14000 [8000-20000],39 [23-59]
4,Afghanistan,2014,14000 [8400-22000],43 [25-65]

üè∑Ô∏è 4. Modificar los nombres de las columnas por los siguientes:
> * 'Country'
> * 'year'
> * 'NroDeaths_ehiv'
> * 'NroDeaths_nhiv'

In [5]:
headers = ['country', 'year', 'nroDeaths_ehiv', 'nroDeaths_nhiv']
df.columns = headers
df.head()

       country  year      nroDeaths_ehiv nroDeaths_nhiv
0  Afghanistan  2018  11000 [6400-16000]     29 [17-44]
1  Afghanistan  2017  11000 [6400-16000]     30 [18-45]
2  Afghanistan  2016  12000 [7100-18000]     34 [20-51]
3  Afghanistan  2015  14000 [8000-20000]     39 [23-59]
4  Afghanistan  2014  14000 [8400-22000]     43 [25-65]

üè∑Ô∏è 5. Separar las variable NroDeaths_ehiv y NroDeaths_nhiv en las siguientes:

* NroDeaths_ehiv
 - NroDeaths_ehiv_value
 - NroDeaths_ehiv_intervalo

* NroDeaths_nhiv
 - NroDeaths_nhiv_value
 - NroDeaths_nhiv_intervalo

In [6]:
df[['nroDeaths_ehiv_value','nroDeaths_ehiv_intervalo']] = df.nroDeaths_ehiv.str.split(expand=True)
df[['nroDeaths_nhiv_value','nroDeaths_nhiv_intervalo']] = df.nroDeaths_nhiv.str.split(expand=True)

üè∑Ô∏è 6. Eliminar las columnas: `NroDeaths_ehiv` y `NroDeaths_nhiv`

In [7]:
df.drop(columns=['nroDeaths_ehiv','nroDeaths_nhiv'], inplace=True)

df.head()

,country,year,nroDeaths_ehiv_value,nroDeaths_ehiv_intervalo,nroDeaths_nhiv_value,nroDeaths_nhiv_intervalo
0,Afghanistan,2018,11000,[6400-16000],29,[17-44]
1,Afghanistan,2017,11000,[6400-16000],30,[18-45]
2,Afghanistan,2016,12000,[7100-18000],34,[20-51]
3,Afghanistan,2015,14000,[8000-20000],39,[23-59]
4,Afghanistan,2014,14000,[8400-22000],43,[25-65]

üè∑Ô∏è 7. Generar un dataframe que contenga cuatro columnas: 
> * **country**
> * **year**
> * **concepto**: que tenga los datos de las variables roDeaths_ehiv_value y NroDeaths_nhiv_value.
> * **value**

In [22]:
ehiv = df.pivot(index='country', columns='year', values='nroDeaths_ehiv_value')
nhiv = df.pivot(index='country', columns='year', values='nroDeaths_nhiv_value')

In [23]:
ehiv.head()

year,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
country,,,,,,,,,,,,,,,,,,,
Afghanistan,14000,13000,13000,14000,13000,12000,11000,10000,11000,13000,12000,13000,14000,14000,14000,14000,12000,11000,11000
Albania,22,20,20,19,26,12,11,16,16,5,9,9,9,8,8,8,8,8,8
Algeria,2500,2500,2600,2700,2700,2900,2900,2900,2800,3000,3100,2900,3000,2800,3100,3200,3100,3100,3200
Andorra,1,1,0,1,1,1,1,0,0,1,1,0,1,0,1,0,0,0,0
Angola,12000,11000,11000,9800,12000,13000,10000,16000,14000,19000,16000,18000,15000,14000,17000,16000,17000,19000,19000

In [24]:
nhiv.head()

year,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
country,,,,,,,,,,,,,,,,,,,
Afghanistan,68,62,57,58,51,47,43,39,40,44,43,44,44,43,43,39,34,30,29
Albania,0.69,0.65,0.63,0.6,0.84,0.39,0.35,0.52,0.53,0.17,0.29,0.29,0.29,0.29,0.29,0.29,0.29,0.29,0.29
Algeria,8.2,8,8.2,8.4,8.4,8.8,8.6,8.6,8.1,8.4,8.5,8,8,7.4,7.9,8.1,7.7,7.6,7.6
Andorra,1.7,1.4,0.67,1.4,0.87,1.2,1.4,0.57,0.45,0.9,0.78,0.34,1,0.58,0.72,0.48,0.49,0.12,0.25
Angola,73,66,60,54,63,68,51,77,65,84,69,74,61,55,62,57,58,65,60

In [46]:
data = df.melt(id_vars=['country','year'],
                value_vars=['nroDeaths_ehiv_value','nroDeaths_nhiv_value'],
                var_name='ehiv-nhiv',
                value_name='deaths')

data.query('year == 2018').head(10)

                 country  year             ehiv-nhiv deaths
0            Afghanistan  2018  nroDeaths_ehiv_value  11000
19               Albania  2018  nroDeaths_ehiv_value      8
38               Algeria  2018  nroDeaths_ehiv_value   3200
57               Andorra  2018  nroDeaths_ehiv_value      0
76                Angola  2018  nroDeaths_ehiv_value  19000
95   Antigua and Barbuda  2018  nroDeaths_ehiv_value      1
114            Argentina  2018  nroDeaths_ehiv_value    640
133              Armenia  2018  nroDeaths_ehiv_value     18
152            Australia  2018  nroDeaths_ehiv_value     50
171              Austria  2018  nroDeaths_ehiv_value     35